[
  {
    "id": 1,
    "image": "https://i.ibb.co/QjBLPzM/app1.png",
    "title": "📸 PhotoSnap - Professional Photo Editor",
    "companyName": "Pixel Labs",
    "description": "PhotoSnap is a next-generation AI-powered photo editor that helps you transform ordinary pictures into extraordinary creations. With its advanced filters, lighting correction tools, and background remover, it’s designed for both beginners and professionals. Whether you’re editing selfies, portraits, or travel photos, PhotoSnap gives you full creative control. You can add overlays, stickers, custom text, and artistic effects within seconds. The app also includes an integrated collage maker, cloud storage, and one-tap social media sharing. Our latest update introduces real-time beauty retouch, sky replacement, and AI-based auto-enhance for perfect photos every time. PhotoSnap also supports RAW image editing, batch processing, and HD export up to 8K resolution, making it one of the most powerful mobile editors available today.",
    "size": 55,
    "reviews": "2.4K",
    "ratingAvg": 4.6,
    "downloads": "8",
    "ratings": [
      { "name": "1 star", "count": 95 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 750 },
      { "name": "5 star", "count": 1235 }
    ]
  },
  {
    "id": 2,
    "image": "https://i.ibb.co/0Jm6zkL/app2.png",
    "title": "✅ TaskMaster - Smart Task Organizer",
    "companyName": "WorkFlow Inc.",
    "description": "TaskMaster is your ultimate productivity partner that brings order to your daily life. From managing personal goals to leading a professional project team, it adapts to your workflow. You can create smart lists, recurring reminders, sub-tasks, and collaborative boards. The built-in focus timer and progress tracker help you stay consistent and beat procrastination. TaskMaster integrates with Google Calendar, Slack, and Microsoft Teams for seamless scheduling. Its AI assistant gives smart suggestions on when to work, rest, or review tasks. You can also attach files, voice notes, and links for quick access. Whether you’re a student planning your studies or a business owner managing deadlines, TaskMaster ensures everything is perfectly organized and easy to track from any device.",
    "size": 42,
    "reviews": "1.8K",
    "ratingAvg": 4.3,
    "downloads": "6.5",
    "ratings": [
      { "name": "1 star", "count": 65 },
      { "name": "2 star", "count": 95 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 580 },
      { "name": "5 star", "count": 850 }
    ]
  },
  {
    "id": 3,
    "image": "https://i.ibb.co/ZG3QKjy/app3.png",
    "title": "💪 FitZone - AI Fitness & Workout Coach",
    "companyName": "ActiveBody Ltd.",
    "description": "FitZone is a personalized AI-powered fitness companion that designs a workout and diet plan tailored specifically for you. It offers over 500+ guided exercises, home and gym training plans, and smart tracking for calories and body metrics. You can also access live training videos, meditation sessions, and yoga tutorials for mental wellness. FitZone automatically adjusts your plan based on your performance, fatigue level, and body type. The built-in social challenge mode lets you compete with friends and stay motivated. The latest version includes smartwatch integration, water reminders, and health analytics powered by AI insights. Whether you want to lose weight, build muscle, or improve stamina — FitZone helps you achieve it naturally with consistency and fun.",
    "size": 78,
    "reviews": "3.9K",
    "ratingAvg": 4.8,
    "downloads": "15",
    "ratings": [
      { "name": "1 star", "count": 75 },
      { "name": "2 star", "count": 110 },
      { "name": "3 star", "count": 260 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 2655 }
    ]
  },
  {
    "id": 4,
    "image": "https://i.ibb.co/hRrz8L6/app4.png",
    "title": "🛒 ShopSmart - Save More on Every Purchase",
    "companyName": "Ecomify",
    "description": "ShopSmart revolutionizes your online shopping experience by helping you compare prices across major platforms instantly. It automatically finds coupons, cashback offers, and exclusive discounts before you checkout. The app tracks price drops and alerts you when your favorite products are on sale. You can browse millions of products from Amazon, eBay, AliExpress, and local stores all in one place. The in-built review analyzer helps you identify fake ratings and pick trusted sellers. ShopSmart also supports voice search, wishlist sync, and AI-based deal prediction. With secure payment tracking, order history, and refund assistance, ShopSmart ensures you always shop smarter and safer. Save big every time you buy online!",
    "size": 60,
    "reviews": "2.9K",
    "ratingAvg": 4.4,
    "downloads": "11",
    "ratings": [
      { "name": "1 star", "count": 130 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 280 },
      { "name": "4 star", "count": 760 },
      { "name": "5 star", "count": 1570 }
    ]
  },
  {
    "id": 5,
    "image": "https://i.ibb.co/0yRFwZ7/app5.png",
    "title": "🎵 MusicWave - Stream & Download Songs",
    "companyName": "Soundly Studio",
    "description": "MusicWave lets you dive into a world of music with millions of tracks available for streaming and offline playback. Discover trending hits, explore emerging artists, and customize playlists for every mood. With its powerful recommendation engine, you’ll always find songs that match your taste. The app supports high-quality audio up to 320kbps, lyrics sync, and sleep timer. You can also download tracks for offline listening without ads. MusicWave comes with an equalizer, sound booster, and real-time visualizer to enhance your music journey. Plus, it features exclusive artist interviews, podcasts, and live concerts so you can connect with your favorite musicians like never before. Experience music without boundaries — wherever you go.",
    "size": 95,
    "reviews": "5.2K",
    "ratingAvg": 4.9,
    "downloads": "25",
    "ratings": [
      { "name": "1 star", "count": 140 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 340 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 3640 }
    ]
  },
  {
    "id": 6,
    "image": "https://i.ibb.co/7bY3V7C/app6.png",
    "title": "🧘 ZenSpace - Mindfulness & Meditation",
    "companyName": "CalmTech",
    "description": "ZenSpace offers guided meditation sessions, breathing exercises, sleep stories, and mood tracking to help you achieve mental clarity and relaxation. With daily mindfulness reminders and personalized meditation plans, ZenSpace is your companion in reducing stress and enhancing focus. The app also features a sleep tracker and calming soundscapes to improve your sleep quality.",
    "size": 45,
    "reviews": "2.1K",
    "ratingAvg": 4.7,
    "downloads": "5",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 1320 }
    ]
  },
  {
    "id": 7,
    "image": "https://i.ibb.co/8bX8R3F/app7.png",
    "title": "📚 StudyBuddy - Student Planner",
    "companyName": "EduTech",
    "description": "StudyBuddy helps students organize their study schedules, track assignments, and set reminders for exams. With a built-in calendar, task prioritization, and progress tracking, it ensures you stay on top of your academic responsibilities. The app also offers group study features and collaborative note-sharing to enhance learning.",
    "size": 38,
    "reviews": "3.4K",
    "ratingAvg": 4.5,
    "downloads": "7",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 2340 }
    ]
  },
  {
    "id": 8,
    "image": "https://i.ibb.co/1Lq3F0P/app8.png",
    "title": "🎮 GameHub - Mobile Gaming Platform",
    "companyName": "PlayTech",
    "description": "GameHub is a mobile gaming platform that offers a wide range of games across various genres. With features like multiplayer support, leaderboards, and in-game achievements, it provides an engaging gaming experience. The app also includes game recommendations based on your preferences and gaming history.",
    "size": 120,
    "reviews": "4.5K",
    "ratingAvg": 4.3,
    "downloads": "10",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 1200 },
      { "name": "5 star", "count": 2950 }
    ]
  },
  {
    "id": 9,
    "image": "https://i.ibb.co/7V8Wz0T/app9.png",
    "title": "📦 PackMate - Delivery Tracker",
    "companyName": "LogiTech",
    "description": "PackMate allows you to track your deliveries in real-time, providing updates on shipment status, estimated delivery times, and notifications for any delays. With support for multiple courier services, it ensures you never miss a package again. The app also offers package scanning and history tracking for easy reference.",
    "size": 50,
    "reviews": "2.8K",
    "ratingAvg": 4.6,
    "downloads": "6",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1760 }
    ]
  },
  {
    "id": 10,
    "image": "https://i.ibb.co/6n2X5Yw/app10.png",
    "title": "🛠️ FixIt - DIY Repair Guide",
    "companyName": "HandyTools",
    "description": "FixIt provides step-by-step DIY repair tutorials for electronics, home appliances, and furniture. With images, videos, and expert tips, users can save money while learning practical repair skills. The app also includes a tool inventory checklist and troubleshooting tips for common issues.",
    "size": 40,
    "reviews": "2.2K",
    "ratingAvg": 4.5,
    "downloads": "4",
    "ratings": [
      { "name": "1 star", "count": 55 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 1450 }
    ]
  },
  {
    "id": 11,
    "image": "https://i.ibb.co/NKQJmR6/app11.png",
    "title": "🍳 CookMate - Recipe & Meal Planner",
    "companyName": "Foodies Inc.",
    "description": "CookMate provides thousands of recipes with step-by-step instructions, video tutorials, and nutritional information. Plan your weekly meals, create shopping lists, and explore healthy options. The app also allows saving favorite recipes and sharing them with friends. AI suggestions help you discover new dishes based on your taste preferences.",
    "size": 50,
    "reviews": "2.5K",
    "ratingAvg": 4.6,
    "downloads": "8",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1360 }
    ]
  },
  {
    "id": 12,
    "image": "https://i.ibb.co/k0m6bK9/app12.png",
    "title": "🖌️ DrawPad - Sketch & Paint",
    "companyName": "CreativeTools",
    "description": "DrawPad is a versatile sketching and painting app for artists of all levels. It offers brushes, pencils, markers, layers, blending modes, and customizable color palettes. Users can create digital artwork, doodle, or edit images. Export in PNG, JPG, and PSD formats. AI-assisted drawing features help with shapes, symmetry, and perspective.",
    "size": 70,
    "reviews": "3.1K",
    "ratingAvg": 4.7,
    "downloads": "12",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 220 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 1850 }
    ]
  },
  {
    "id": 13,
    "image": "https://i.ibb.co/1zdHn2r/app13.png",
    "title": "📝 NoteKeeper - Smart Notes & To-Do",
    "companyName": "NoteTech",
    "description": "NoteKeeper lets you capture ideas, create checklists, and organize notes with tags and folders. Voice notes, reminders, and cloud sync across devices ensure you never lose an important thought. AI-powered search helps you find notes instantly, and collaborative features allow sharing with colleagues and friends.",
    "size": 30,
    "reviews": "1.7K",
    "ratingAvg": 4.4,
    "downloads": "6",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 820 }
    ]
  },
  {
    "id": 14,
    "image": "https://i.ibb.co/DfKg7nV/app14.png",
    "title": "🏃 MoveFit - Activity & Step Tracker",
    "companyName": "ActiveLife",
    "description": "MoveFit tracks your daily activity, steps, calories burned, and distance covered. Set fitness goals, get AI-driven activity suggestions, and connect with friends for challenges. Compatible with smartwatches and wearable devices, the app motivates you to stay active and maintain a healthy lifestyle with personalized insights.",
    "size": 55,
    "reviews": "2.8K",
    "ratingAvg": 4.5,
    "downloads": "9",
    "ratings": [
      { "name": "1 star", "count": 55 },
      { "name": "2 star", "count": 75 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1750 }
    ]
  },
  {
    "id": 15,
    "image": "https://i.ibb.co/vB7ytgJ/app15.png",
    "title": "🌍 TravelMate - Trip Planner & Guide",
    "companyName": "TravelTech",
    "description": "TravelMate helps plan trips, book hotels, flights, and experiences. Get detailed itineraries, local guides, offline maps, and AI recommendations for attractions, restaurants, and activities. Track expenses, weather, and bookings in one place. Perfect for solo travelers, families, and adventure seekers.",
    "size": 80,
    "reviews": "3.3K",
    "ratingAvg": 4.6,
    "downloads": "14",
    "ratings": [
      { "name": "1 star", "count": 65 },
      { "name": "2 star", "count": 85 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 850 },
      { "name": "5 star", "count": 1880 }
    ]
  },
  {
    "id": 16,
    "image": "https://i.ibb.co/dP3q6x8/app16.png",
    "title": "💼 BizManager - Business Organizer",
    "companyName": "ProBiz Solutions",
    "description": "BizManager helps small business owners organize projects, clients, and finances. Features include task management, invoicing, client tracking, and team collaboration. AI insights provide productivity tips and financial summaries. Sync across devices ensures all team members stay updated in real time.",
    "size": 65,
    "reviews": "2.0K",
    "ratingAvg": 4.5,
    "downloads": "7",
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 1215 }
    ]
  },
  {
    "id": 17,
    "image": "https://i.ibb.co/3W4vFyf/app17.png",
    "title": "🎯 FocusTime - Productivity Timer",
    "companyName": "WorkSmart",
    "description": "FocusTime is a productivity app that uses Pomodoro technique and AI analytics to help you stay focused. Track sessions, set goals, and visualize productivity trends. Alerts and reminders ensure you minimize distractions. Collaborative features allow team task tracking and performance monitoring.",
    "size": 25,
    "reviews": "1.9K",
    "ratingAvg": 4.4,
    "downloads": "5",
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 55 },
      { "name": "3 star", "count": 170 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1040 }
    ]
  },
  {
    "id": 18,
    "image": "https://i.ibb.co/2sZ9rFp/app18.png",
    "title": "📸 InstaPic - Social Photo Sharing",
    "companyName": "SnapWorld",
    "description": "InstaPic lets users share photos and videos with friends, follow trending content, and interact through likes, comments, and stories. The app includes photo filters, stickers, and AI suggestions for hashtags. Explore new content with personalized feeds and trending challenges.",
    "size": 60,
    "reviews": "4.0K",
    "ratingAvg": 4.6,
    "downloads": "20",
    "ratings": [
      { "name": "1 star", "count": 75 },
      { "name": "2 star", "count": 95 },
      { "name": "3 star", "count": 220 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 1710 }
    ]
  },
  {
    "id": 19,
    "image": "https://i.ibb.co/xmZ5z1t/app19.png",
    "title": "💡 IdeaBox - Brainstorm & Creativity",
    "companyName": "Innovate Labs",
    "description": "IdeaBox helps users capture creative ideas, organize thoughts, and collaborate with teams. Features include mind maps, voice notes, tagging, and AI suggestions. Share ideas instantly and track progress on projects. Ideal for students, entrepreneurs, and creatives.",
    "size": 35,
    "reviews": "1.5K",
    "ratingAvg": 4.3,
    "downloads": "4",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 450 },
      { "name": "5 star", "count": 825 }
    ]
  },
  {
    "id": 20,
    "image": "https://i.ibb.co/5tQYg5T/app20.png",
    "title": "🎶 SoundPulse - Music Player & Equalizer",
    "companyName": "AudioWave",
    "description": "SoundPulse is a music player with equalizer, playlists, offline playback, and visualizer. Customize audio settings, discover new tracks, and enjoy a seamless listening experience. Share songs with friends and explore curated playlists for different moods.",
    "size": 50,
    "reviews": "3.2K",
    "ratingAvg": 4.7,
    "downloads": "10",
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 65 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 750 },
      { "name": "5 star", "count": 1200 }
    ]
  }
]
